Tekla Open API Reference for Tekla Structures 2025
ModelObjectEnumerator Properties
The ModelObjectEnumerator type exposes the following members.
Properties
Name | Description
AutoFetch
 Indicates that the objects are fetched from the model when the enumerator is created. Object information is therefore not anymore fetched when 'Current' item is asked from the enumerator. Warning: changing of TransformationPlane after creation of enumerator or during the enumeration requires a separate selection of object for refreshing the values. Property value is used for all enumerators in application
Current
 The current model object instance active in the enumerator. The value is null if there are no more objects left.
SelectInstances
 Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator. The user can set this to 'false' if no members are ever asked from the instance. This is the case when, for example, asking only a report property from the identifier. Warning: normally the user should not change this value.
Top
See Also
Reference
ModelObjectEnumerator Class
Tekla.Structures.Model Namespace